Table of Contents
 Class IdeaElement1D
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaElement1D : AbstractIdeaObject<IIdeaElement1D>, IEquatable<AbstractIdeaObject<IIdeaElement1D>>, IIdeaElement1D, IIdeaObjectWithResults, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaElement1D>
IdeaElement1D
Implements
IEquatable<AbstractIdeaObject<IIdeaElement1D>>
IIdeaElement1D
IIdeaObjectWithResults
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaElement1D>.Id
 AbstractIdeaObject<IIdeaElement1D>.Name
 AbstractIdeaObject<IIdeaElement1D>.Identifier
 AbstractIdeaObject<IIdeaElement1D>.GetHashCode()
 AbstractIdeaObject<IIdeaElement1D>.Equals(object)
 AbstractIdeaObject<IIdeaElement1D>.Equals(AbstractIdeaObject<IIdeaElement1D>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaElement1D(Identifier<IIdeaElement1D>)
public IdeaElement1D(Identifier<IIdeaElement1D> identifer)
Parameters
identifer Identifier<IIdeaElement1D>
 IdeaElement1D(int)
public IdeaElement1D(int id)
Parameters
id int
 IdeaElement1D(string)
public IdeaElement1D(string id)
Parameters
id string
Properties
 EccentricityBegin
Eccentricity (offset) at the start of the element. It is defined in the global coordinate system.
public virtual IdeaVector3D EccentricityBegin { get; set; }
Property Value
IdeaVector3D
 EccentricityEnd
Eccentricity (offset) at the end of the element. It is defined in the global coordinate system.
public virtual IdeaVector3D EccentricityEnd { get; set; }
Property Value
IdeaVector3D
 EndCrossSection
Cross-section at the and of the element.
public virtual IIdeaCrossSection EndCrossSection { get; set; }
Property Value
IIdeaCrossSection
 RotationRx
Rotation of the element around the x-axis of the Segment's LCS.
public virtual double RotationRx { get; set; }
Property Value
double
 Segment
Returns the segment object that should implement either IIdeaLineSegment3D or IIdeaArcSegment3D. Must not return null.
Hint: use is-operator to determine the segment type.
public virtual IIdeaSegment3D Segment { get; set; }
Property Value
IIdeaSegment3D
 StartCrossSection
Cross-section at the start of the element.
public virtual IIdeaCrossSection StartCrossSection { get; set; }
Property Value
IIdeaCrossSection
Methods
 GetResults()
public virtual IEnumerable<IIdeaResult> GetResults()
Returns
IEnumerable<IIdeaResult>
 Edit this page